_posts/2020-06-21-setup-vim28.html
---
title: Vim28 설치하기
tags: vim
toc: true
toc_sticky: true
---

<div id="outline-container-org92a0afe" class="outline-2">
<h2 id="org92a0afe">Setting up</h2>
<div class="outline-text-2" id="text-org92a0afe">
<pre class="example">
sudo add-apt-repository ppa:jonathonf/vim
sudo apt update
sudo apt install vim
sudo apt-get install vim
vi ~/.bashrc
source ~/.bashrc
</pre>

<p>
Append this line to .bashrc
</p>
<pre class="example">
export VIMRUNTIME=/usr/share/vim/vim82
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">a</td>
<td class="org-left">b</td>
<td class="org-left">c</td>
</tr>

<tr>
<td class="org-left">hello</td>
<td class="org-left">world</td>
<td class="org-left">table</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org1c6f648" class="outline-2">
<h2 id="org1c6f648">Reference</h2>
<div class="outline-text-2" id="text-org1c6f648">
<ul class="org-ul">
<li><a href="http://ubuntuhandbook.org/index.php/2019/12/install-vim-8-2-ubuntu-18-04-16-04-19-10/">http://ubuntuhandbook.org/index.php/2019/12/install-vim-8-2-ubuntu-18-04-16-04-19-10/</a></li>
<li><a href="https://askubuntu.com/questions/445686/vim-cannot-find-syntax-vim">https://askubuntu.com/questions/445686/vim-cannot-find-syntax-vim</a></li>
</ul>
</div>
</div>
